=== Test 1: link/unlink only work on files ===
Updated 1 path from the index
Disk image size=512000, 500 blocks
fso-sh> created dir with inode 13
fso-sh> link failed!
fso-sh> created inode 14
fso-sh> new link to inode 14
fso-sh> unlink failed!
fso-sh> removed one link to inode 14
fso-sh> listing dir / (inode 0):
ino:type:nlk    bytes name
  1:   F:  1        0 f0
  2:   D:  1      128 dir1
  3:   F:  1      617 file10
  5:   F:  1        0 lixo
  4:   F:  2     5562 link.txt
 11:   F:  1        0 1
 12:   D:  1        0 e
 13:   D:  1        0 mydir
 14:   F:  1        0 link_to_file
fso-sh> closing emulated disk.

=== Test 2: fs_ls returns 0 on success, -1 on error ===
Updated 1 path from the index
Disk image size=512000, 500 blocks
fso-sh> listing dir / (inode 0):
ino:type:nlk    bytes name
  1:   F:  1        0 f0
  2:   D:  1      128 dir1
  3:   F:  1      617 file10
  5:   F:  1        0 lixo
  4:   F:  2     5562 link.txt
 11:   F:  1        0 1
 12:   D:  1        0 e
fso-sh> No such directory with name /nonexistent
list failed
fso-sh> created inode 13
fso-sh> /file is not a directory
list failed
fso-sh> closing emulated disk.

=== Test 3: Directory size doesn't decrease when deleting ===
Updated 1 path from the index
Disk image size=512000, 500 blocks
fso-sh> created inode 13
fso-sh> created inode 14
fso-sh> created inode 15
fso-sh> Disk superblock 0:
    magic = f50f5025
    disk size 500 blocks
    block size 1024 bytes
    bmap_size: 1
    first inode block: 2
    inode_blocks: 4 (128 inodes)
    first data block: 6
    data blocks: 494
**************************************
blocks in use - bitmap:
1111111111 1111111110 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 000000
**************************************
inodes in use:
 0:type=4;size=640;nlinks=0
 1:type=8;size=0;nlinks=1
 2:type=4;size=128;nlinks=1
 3:type=8;size=617;nlinks=1
 4:type=8;size=5562;nlinks=2
 5:type=8;size=0;nlinks=1
 6:type=4;size=128;nlinks=1
 7:type=8;size=2;nlinks=1
 8:type=4;size=64;nlinks=1
 9:type=4;size=64;nlinks=1
 10:type=8;size=0;nlinks=1
 11:type=8;size=0;nlinks=1
 12:type=4;size=0;nlinks=1
 13:type=8;size=0;nlinks=1
 14:type=8;size=0;nlinks=1
 15:type=8;size=0;nlinks=1
**************************************
fso-sh> removed one link to inode 14
fso-sh> Disk superblock 0:
    magic = f50f5025
    disk size 500 blocks
    block size 1024 bytes
    bmap_size: 1
    first inode block: 2
    inode_blocks: 4 (128 inodes)
    first data block: 6
    data blocks: 494
**************************************
blocks in use - bitmap:
1111111111 1111111110 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 000000
**************************************
inodes in use:
 0:type=4;size=640;nlinks=0
 1:type=8;size=0;nlinks=1
 2:type=4;size=128;nlinks=1
 3:type=8;size=617;nlinks=1
 4:type=8;size=5562;nlinks=2
 5:type=8;size=0;nlinks=1
 6:type=4;size=128;nlinks=1
 7:type=8;size=2;nlinks=1
 8:type=4;size=64;nlinks=1
 9:type=4;size=64;nlinks=1
 10:type=8;size=0;nlinks=1
 11:type=8;size=0;nlinks=1
 12:type=4;size=0;nlinks=1
 13:type=8;size=0;nlinks=1
 15:type=8;size=0;nlinks=1
**************************************
fso-sh> created inode 14
fso-sh> Disk superblock 0:
    magic = f50f5025
    disk size 500 blocks
    block size 1024 bytes
    bmap_size: 1
    first inode block: 2
    inode_blocks: 4 (128 inodes)
    first data block: 6
    data blocks: 494
**************************************
blocks in use - bitmap:
1111111111 1111111110 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 0000000000 000000000
0000000000 0000000000 000000
**************************************
inodes in use:
 0:type=4;size=640;nlinks=0
 1:type=8;size=0;nlinks=1
 2:type=4;size=128;nlinks=1
 3:type=8;size=617;nlinks=1
 4:type=8;size=5562;nlinks=2
 5:type=8;size=0;nlinks=1
 6:type=4;size=128;nlinks=1
 7:type=8;size=2;nlinks=1
 8:type=4;size=64;nlinks=1
 9:type=4;size=64;nlinks=1
 10:type=8;size=0;nlinks=1
 11:type=8;size=0;nlinks=1
 12:type=4;size=0;nlinks=1
 13:type=8;size=0;nlinks=1
 14:type=8;size=0;nlinks=1
 15:type=8;size=0;nlinks=1
**************************************
fso-sh> closing emulated disk.
